<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Documentation G&eacute;n&eacute;Graphe</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="style.css" rel="stylesheet" type="text/css">
</head>

<body>
<h2><a name="haut"></a>Importer</h2>
<p><a href="#A1">Appel de la fonction </a> - <a href="#A2">Choisirir un arbre</a> - <a href="#A3">Importation</a></p>
<p>L'importation vous permet de recopier des &eacute;l&eacute;ments d'un arbre vers l'arbre courant. Ces &eacute;l&eacute;ments sont des personnes et/ou des &eacute;tiquettes libres.</p>
<hr>
<h4><a name="A3" id="A3"></a> Appel de la fonction <a href="#haut"><img src="images/debut.gif" width="16" height="16" border="0"></a></h4>
<p>Quand vous appelez cette fonction, une fen&ecirc;tre vous permet de choisir les &eacute;l&eacute;ments &agrave; importer :</p>
<p><img src="images/importer01.png" width="416" height="512"> </p>
<h4><a name="A2" id="A2"></a>Choisirir un arbre</h4>
<p>Le menu d&eacute;roulant, en haut de la page, vous permet de choisir l'arbre &agrave; partir duquel vous allez recopier des &eacute;l&eacute;ments.</p>
<p> <img src="images/importer02.png" width="416" height="512"></p>
<p>Quand vous avez choisi un arbre, vous disposez de la liste des personnes qui y figurent ainsi que de la liste des &eacute;tiquettes. Pour les &eacute;tiquettes, vous voyez le d&eacute;but du texte qu'elles contiennent.</p>
<p>Pour les personnes, vous pouvez choisir d'importer les images ou pas. La case &agrave; cocher pour ce choix n'appara&icirc;t que quand vous avez li&eacute; une ou plusieurs images &agrave; cette personne. </p>
<p>Les cases &agrave; cocher permettent de s&eacute;lectionner ou d&eacute;s&eacute;lectionner toute la colonne correspondante. </p>
<hr>
<h4><a name="A3" id="A3"></a> Importation <a href="#haut"><img src="images/debut.gif" width="16" height="16" border="0"></a></h4>
<p>Quand vous cliquez sur le bouton Importer, les objets s&eacute;lectionn&eacute;s sont recopi&eacute;s dans l'arbre courant. Ils sont plac&eacute;s au m&ecirc;me endroit que dans l'arbre d'origine. Les personnes ont le m&ecirc;me mod&egrave;le d'&eacute;tiquette que celui d'origine. </p>
</body>
</html>
