<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Documentation G&eacute;n&eacute;Graphe</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="style.css" rel="stylesheet" type="text/css">
</head>

<body>
<h2><a name="haut"></a>Placement d'objets</h2>
<p><a href="#A1">Placement &agrave; la souris</a> - <a href="#A2">Placement au clavier</a> - <a href="#A3">Alignements et espacements de personnes</a></p>
<h4><a name="A1"></a>Placement d'objet &agrave; la souris</h4>
<p>Vous pouvez d&eacute;placer tous les objets d'un arbre en :</p>
<ul>
  <li>mettant le curseur sur l'objet ;</li>
  <li>appuyant sur le bouton gauche de la souris<img src="images/sourisGauche.jpg" width="26" height="47">  ;</li>
  <li>d&eacute;pla&ccedil;ant le curseur ;</li>
  <li>rel&acirc;chant le bouton &agrave; l' endroit o&ugrave; vous voulez positionner l'objet.
  </li>
</ul>
<hr>
<h4><a name="A2"></a>Placement d'objet au clavier <a href="#haut"><img src="images/debut.gif" width="16" height="16" border="0"></a></h4>
<p>Quand un ou plusieurs objets sont s&eacute;lectionn&eacute;s, vous pouvez les d&eacute;placer avec les fl&egrave;ches de votre clavier <img src="images/toucheGauche.jpg" width="35" height="29"> <img src="images/toucheHaut.jpg" width="35" height="29"> <img src="images/toucheDroite.jpg" width="35" height="29"> <img src="images/toucheBas.jpg" width="35" height="29">. Le d&eacute;placement appliqu&eacute; est d'un pixel.<br>
Si vous appuyez sur <img src="images/toucheShift.jpg" width="62" height="29">, le d&eacute;placement est par 5 pixels.<br>
Si vous appuyez sur la touche <img src="images/toucheCtrl.jpg" width="35" height="29">, le d&eacute;placement est par 10 pixels.<br>
Si vous appuyez sur les touches <img src="images/toucheShift.jpg" width="62" height="29"> et <img src="images/toucheCtrl.jpg" width="35" height="29">, le d&eacute;placement est par 15 pixels.</p>
<h4><a name="A3"></a>Alignements et espacements de personnes  <a href="#haut"><img src="images/debut.gif" width="16" height="16" border="0"></a></h4>
<p>Quand une ou plusieurs personnes sont s&eacute;lectionn&eacute;es, vous pouvez demander &agrave; G&eacute;n&eacute;Graphe de g&eacute;rer les alignements. Allez dans le menu Disposition. Vous y trouvez un choix de possibilit&eacute;s :</p>
<table border="0" cellpadding="5">
  <tr>
    <td><img src="images/placer01.png" width="235" height="422" border="1" align="left"></td>
    <td class="alignHaut"><p>Le choix &laquo;Haut&raquo; aligne horizontalement toutes les personnes sur la personne la plus haute.</p>
      <p>Le choix &laquo;Milieu&raquo; aligne horizontalement toutes les personnes au milieu en tenant compte de la personne la plus basse et de la personne la plus haute.</p>
      <p>Le choix &laquo;Bas&raquo; aligne horizontalement toutes les personnes sur la personne la plus basse.</p>
      <p>Le choix &laquo;Gauche&raquo; aligne verticalement toutes les personnes sur la personne la plus &agrave; gauche.</p>
      <p>Le choix &laquo;Centre&raquo; aligne verticalement toutes les personnes au milieu en tenant compte de la personne la plus &agrave; gauche et de la personne la plus &agrave; droite.</p>
      <p>Le choix &laquo;Droite&raquo; aligne verticalement toutes les personnes sur la personne la plus &agrave; droite.</p>
      <p>Le choix &laquo;Espacement horizontal &raquo; r&eacute;partit les personnes horizontalement entre  la plus &agrave; gauche et  la plus &agrave; droite.</p>
    <p>Le choix &laquo;Espacement vertical &raquo; r&eacute;partit les personnes verticalement entre  la plus haute et  la plus basse. </p>
    <p>Le choix &laquo; Centrer les personnes &raquo; centre les parents s&eacute;lectionn&eacute;s par rapport aux enfants. </p>
    <p>Le choix &laquo; Centrer les enfants &raquo; centre les enfants par rapport aux parents qui sont s&eacute;lectionn&eacute;s. </p></td>
  </tr>
</table>
</body>
</html>